Белгипрозем_2017/src/InformationRegisters/СтатьиДвиженияДенежныхСредствДокументов/СтатьиДвиженияДенежныхСредствДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатьиДвиженияДенежныхСредствДокументов</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/СтатьиДвиженияДенежныхСредствДокументов/ManagerModule.bsl
// Записывает статьи ДДС указанного документа в привилегированном режиме.
//
// Параметры:
//   Документ - СправочникСсылка.ВнутреннийДокумент - документ, статьи которого записываются.
//   СтатьиДвиженияДенежныхСредств - ДанныеФормыКоллекция или ТаблицаЗначений - записываемые статьи.
//
Процедура ЗаписатьСтатьиДокумента(Документ, СтатьиДвиженияДенежныхСредств) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СтатьиДвиженияДенежныхСредствДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	
	Для каждого СтрокаСтатьи Из СтатьиДвиженияДенежныхСредств Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Документ;
		Запись.СтатьяДвиженияДенежныхСредств = СтрокаСтатьи.СтатьяДвиженияДенежныхСредств;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Читает статьи ДДС указанного документа в привилегированном режиме.
//
// Параметры:
//   Документ - СправочникСсылка.ВнутреннийДокумент - документ, статьи которого записываются.
//   СтатьиДвиженияДенежныхСредств - ДанныеФормыКоллекция или ТаблицаЗначений - неявно возвращаемый параметр.
//
Процедура ПрочитатьСтатьиДокумента(Документ, СтатьиДвиженияДенежныхСредств) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СтатьиДвиженияДенежныхСредствДокументов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();
	
	СтатьиДвиженияДенежныхСредств.Очистить();
	Для каждого Запись Из НаборЗаписей Цикл
		СтрокаСтатьи = СтатьиДвиженияДенежныхСредств.Добавить();
		СтрокаСтатьи.СтатьяДвиженияДенежныхСредств = Запись.СтатьяДвиженияДенежныхСредств;
	КонецЦикла;
	
КонецПроцедуры
